'use strict'

// Задача  1. Дано масив рядкових представлень чисел (тобто масив чисел у лапках (string). З використанням перевірки за допомогою регулярних виразів і груп підрахувати кількість тих, у яких перша і остання літери однакові.

const stringArray = ['143', '133', '156233233111', '45', '11', '445', '85', '114353', '33', '3333', '1', '84325238']

const reg1 = /\b(\d)(\d*?)\1\b/g

const result1 = stringArray.join(', ').match(reg1).length
// console.log(result1)

//========================================================================================================================================================

// Задача 2. Замінити номер розділяючи послідовності цифр дефісом згідно з форматом
// 0504546626   ==>  +380-50-45-466-26

const string2 = '0504546626'

const reg2 = /\b(\d)(\d{2})(\d{2})(\d{3})(\d{2})\b/

const result2 = string2.replace(reg2, '+38$1-$2-$3-$4-$5')
// console.log(result2)

//========================================================================================================================================================

// Задача 3. Після кожного значення року після 2000 року додати «р.» «Я народився 2001, а в школі пішов 2007»  «Я народився 2001р., а в школі пішов 2007р.»

const string3 = 'Я народився 2001, а в школі пішов 2007'

const reg3 = /\b(\d+?)\b/g

const res3 = string3.replace(reg3, '$&р.')
// console.log(res3)

//========================================================================================================================================================

// Задача 4. Вводиться велике число. Кожні 3 розряди відділяти пробілом.
// 7457896524 ==> 7 457 896 524

const string4 = '07986723400856723'

const reg4 = /(\d{3}\B)/g
const res4 = string4.replace(reg4, '$& ')
// console.log(res4)
